Autodesk.Revit.DB.ScheduleDefinition.SetFilters(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ScheduleFilter})
Replaces all filters in this ScheduleDefinition.
filters:
The new list of filters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resulting filter count would be greater than 8.
-or-
A field ID is not the ID of a field in this ScheduleDefinition.
-or-
A field and filter type cannot be used to filter this ScheduleDefinition.
-or-
A filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetSortGroupFields(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ScheduleSortGroupField})
Replaces all sorting/grouping fields in this ScheduleDefinition.
sortGroupFields:
The new list of sorting/grouping fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resulting sorting/grouping field count would be greater than 4.
-or-
A field ID is not the ID of a field in this ScheduleDefinition.
-or-
A field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetFieldOrder(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ScheduleFieldId})
Reorders the fields in the schedule.
fieldIds:
The field IDs in a new order.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldIds does not contain exactly the same field IDs as this ScheduleDefinition currently contains.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013